# IFCRange Class

---
Typically for IFC export, this represents the lower and upper elevations for split wall and column geometry.
SystemObject Autodesk.Revit.DB.IFCIFCRange
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCRange : IDisposable

    Public Class IFCRange
    	Implements IDisposable

    public ref class IFCRange : IDisposable

    type IFCRange =
        class
            interface IDisposable
        end
The IFCRange type exposes the following members.
| Name| Description
---|---|---
| IFCRange|  Instantiates a default IFCRange object.
| IFCRange(IFCRange)|  Instantiates an IFCRange object by copy.
| IFCRange(Double, Double)|  Instantiates an IFCRange object.
Top
| Name| Description
---|---|---
| End|  The ending value of the range.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Start|  The starting value of the range.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCRange
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
It contains two double values representing the starting and ending values as a range.
#### Reference
Autodesk.Revit.DB.IFC Namespace